Pethelper/app/controllers/animals_controller.rb

INSERT INTO "animals" ("nome", "tipo", "raca", "resumo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", ""], ["tipo", ""], ["raca", ""], ["resumo", ""], ["created_at", "2019-05-28 14:53:57.826319"], ["updated_at", "2019-05-28 14:53:57.826319"]]
---
  def create
    @animal = Animal.new(animal_params)
    if @animal.save

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", 1]]
---
 def show
    @animal = Animal.find(params[:id])