Pethelper/app/controllers/casa_abrigos_controller.rb

  def create
    @casa_abrigo = CasaAbrigo.new(casaAbrigo_params)
    if @casa_abrigo.save
---
INSERT INTO "casa_abrigos" ("nome", "documento", "endereco", "telefone", "email", "site", "dadosBanc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

   def show
    @casa_abrigo = CasaAbrigo.find(params[:id])
---
SELECT  "casa_abrigos".* FROM "casa_abrigos" WHERE "casa_abrigos"."id" = ? LIMIT 1  [["id", 4]]