Pethelper/app/controllers/funcionarios_controller.rb

SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", 2]]
---
   def show
    @funcionario = Funcionario.find(params[:id])

INSERT INTO "funcionarios" ("matricula", "nome", "celular", "casa_id", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @funcionario = Funcionario.new(funcionario_params)
    if @funcionario.save