Pethelper/app/controllers/sessions_controller.rb

   def create
    funcionario = Funcionario.find_by(matricula: params[:session][:matricula].downcase)
---
SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."matricula" = ? LIMIT 1  [["matricula", 666]]