Pethelper/app/views/funcionarios/newmanager.html.erb

          <label for="casa_id">Casa de Abrigo</label>
          <%= f.collection_select :casa_id, CasaAbrigo.order(:nome),:id,:nome, include_blank: true %>
---
SELECT "casa_abrigos".* FROM "casa_abrigos"  ORDER BY "casa_abrigos"."nome" ASC